{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2018-2021",
      "school_name": "University of Northern British Columbia"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Mathematics",
      "duration": "2016-2018",
      "school_name": "University of Northern British Columbia"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ChristianNkoy",
  "highlighted_projects": [
    {
      "description": "I worked with a team on designing an algorithm that used a min-max tree to determine the best move in the game of Nim, given a game state. I used Python to implement the algorithm. I tested the application manually by playing multiple games and keeping track of winning/losing records. The program won first place in a competition.",
      "git_url": "https://github.com/chrisnkoy/nim-move",
      "name": "Nim-move"
    },
    {
      "description": "I implemented a virtual machine using Java and multi-threaded programming features such as Runnable, Thread, Lock, and BufferedReader. I used manual testing to ensure that the functionalities of the VM worked correctly. I deployed the app using GitHub.",
      "git_url": "https://github.com/chrisnkoy/vm",
      "name": "VM"
    }
  ],
  "jarvis_projects": [
    {
      "description": "I developed a monitoring agent for a Linux cluster. The monitoring agent collected hardware specifications and resource usage data for each host in the cluster.  I collected data using Bash scripts. I leveraged PostgreSQL for data persistence and used CentOS’s crontab to automate the collection of resource usage data. I tested the MVP using multiple queries on a single machine and deployed it using Git and Docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: I implemented an application that performed CRUD operations against an RDBMS database. The application connected to a PostgreSQL database and executed SQL statements on it. I used Java's JDBC API and the DAO pattern to achieve this. I tested the application manually with multiple SQL queries. I used Docker for deployment.",
        "Grep App: I developed an application that mimics Linux’s grep command. The app scanned an input file for matching strings and wrote each line where a match occurred onto an output file. I took advantage of Java’s tools and features, such as Stream API, and Lambda expressions, as well as IntelliJ, to implement the app. I used Maven for package management and tested the application with multiple text files and string inputs. I also used Docker for deployment."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Christian Nkoy",
  "others": [
    {
      "bullets": [
        "Occupational First Aid Certification"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "UNBC Soccer Intramurals Champion"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Strategy Games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "I work on various projects using relevant technologies such as Linux/Bash, Java, PostgreSQL, Git, and Docker. I collaborate with a team by leveraging the Agile methodology for software development to achieve project goals. As a team lead, I organized daily scrums and communicated with the team about sprint goals, progress, and impediments. I also generated a daily summary of scrum meetings and made it available to the scrum master and product owner.",
      "duration": "November 2022 - present",
      "title": "Software Developer"
    },
    {
      "company": "Sterling Operations",
      "description": "I employed innovative and eﬀicient measures to treat 750+ sites for vegetation and erosion control every season with a 95+% success rate. I trained and mentored new employees and helped them achieve competency in their roles in minimal time. In addition, I communicated regularly with stakeholders to plan and coordinate the implementation of control measures.",
      "duration": "May 2018 - October 2021",
      "title": "Technical Services Specialist - Seasonal"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "CSS",
      "JavaScript",
      "Docker",
      "PostgreSQL",
      "Maven",
      "JUnit",
      "REST API",
      "Multi-threaded programming"
    ],
    "familiar": [
      "C",
      "C++",
      "C#",
      "Flask",
      "NodeJS",
      "ReactJS",
      "Mockito",
      "Event-driven programming"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash",
      "RDBMS/SQL",
      "Git",
      "IntelliJ",
      "Agile/Scrum",
      "Cloud Platform"
    ]
  },
  "summary": "Hi, my name is Christian, and I studied computer science and mathematics at university. I work at Jarvis as a software developer. I love applying logical and abstract thinking to solve complex problems. I aspire to become a full-stack software developer. I am excited at the idea of building applications that solve real-life problems and impact how people use technology. My strengths include a solid mathematical background, the ability to communicate effectively in multiple languages, and an insatiable desire to learn and continually improve. You can catch me on a soccer field or playing a strategy game when I am not writing code."
}
